In [180]:
import pandas as pd
import geopandas as gpd

df_countries_extended = pd.read_csv('./data/countries_extended.csv')
df_global_map = gpd.read_file("data/ne_10m_admin_0_countries/ne_10m_admin_0_countries.shp")
df_weather_compressed = pd.read_parquet('./data/weather_compressed.parquet')

In [190]:

mean_temperature_each_country = round(df_weather_compressed.groupby('country', as_index=False)['avg_temp_c'].mean(), 1)
df_countries_avg_temperatures = df_countries_extended.merge(mean_temperature_each_country, on='country', how='left')
# Verify, that there are no empty values
df_countries_avg_temperatures[df_countries_avg_temperatures['avg_temp_c'].isna()][['country', 'avg_temp_c']]

                              country  avg_temp_c
46   Democratic Republic of the Congo         NaN
76                      Guinea-Bissau         NaN
110                             Macau         NaN
149             Republic of the Congo         NaN
197                     United States         NaN

In [182]:
df_countries_avg_temperatures[['country', 'avg_temp_c']]

               country  avg_temp_c
0          Afghanistan        14.6
1              Albania        14.2
2              Algeria        18.4
3       American Samoa        27.6
4               Angola        25.1
..                 ...         ...
203  Wallis and Futuna        27.3
204     Western Sahara        21.0
205              Yemen        30.5
206             Zambia        23.3
207           Zimbabwe        19.4

[208 rows x 2 columns]

In [191]:
df_countries_avg_temperatures.to_csv('data/countries_avg_temperatures.csv', index=False)

df_global_map_with_temperatures = pd.merge(df_global_map, df_countries_avg_temperatures, on='NAME', how='left')
df_global_map_with_temperatures[['NAME', 'avg_temp_c']]

                        NAME  avg_temp_c
0                  Indonesia        27.3
1                   Malaysia        27.1
2                      Chile        13.6
3                    Bolivia        17.8
4                       Peru        20.1
..                       ...         ...
253                    Macao         NaN
254  Ashmore and Cartier Is.         NaN
255          Bajo Nuevo Bank         NaN
256          Serranilla Bank         NaN
257         Scarborough Reef         NaN

[258 rows x 2 columns]